Jonah-Zhang1/Jonah-Zhang1/R422_S32K324_TEMPLATE_ETH_M7_0/MCAL/Base_TS_T40D34M20I0R0/header/S32K322_I3C.h
/*
** ###################################################################
**     Processor:           S32K322_M7
**     Reference manual:    S32K3xx RM Rev.3
**     Version:             rev. 1.0, 2021-12-03
**     Build:               b211203
**
**     Abstract:
**         Peripheral Access Layer for S32K322_M7
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2021 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K322_I3C.h
 * @version 1.0
 * @date 2021-12-03
 * @brief Peripheral Access Layer for S32K322_I3C
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K322_I3C_H_)  /* Check if memory map has not been already included */
#define S32K322_I3C_H_

#include "S32K322_COMMON.h"

/* ----------------------------------------------------------------------------
   -- I3C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Peripheral_Access_Layer I3C Peripheral Access Layer
 * @{
 */

/** I3C - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCONFIG;                           /**< Master Configuration, offset: 0x0 */
  __IO uint32_t SCONFIG;                           /**< Slave Configuration, offset: 0x4 */
  __IO uint32_t SSTATUS;                           /**< Slave Status, offset: 0x8 */
  __IO uint32_t SCTRL;                             /**< Slave Control, offset: 0xC */
  __IO uint32_t SINTSET;                           /**< Slave Interrupt Set, offset: 0x10 */
  __IO uint32_t SINTCLR;                           /**< Slave Interrupt Clear, offset: 0x14 */
  __I  uint32_t SINTMASKED;                        /**< Slave Interrupt Mask, offset: 0x18 */
  __IO uint32_t SERRWARN;                          /**< Slave Errors and Warnings, offset: 0x1C */
  __IO uint32_t SDMACTRL;                          /**< Slave DMA Control, offset: 0x20 */
  uint8_t RESERVED_0[8];
  __IO uint32_t SDATACTRL;                         /**< Slave Data Control, offset: 0x2C */
  __O  uint32_t SWDATAB;                           /**< Slave Write Data Byte, offset: 0x30 */
  __O  uint32_t SWDATABE;                          /**< Slave Write Data Byte End, offset: 0x34 */
  __O  uint32_t SWDATAH;                           /**< Slave Write Data Half-word, offset: 0x38 */
  __O  uint32_t SWDATAHE;                          /**< Slave Write Data Half-word End, offset: 0x3C */
  __I  uint32_t SRDATAB;                           /**< Slave Read Data Byte, offset: 0x40 */
  uint8_t RESERVED_1[4];
  __I  uint32_t SRDATAH;                           /**< Slave Read Data Half-word, offset: 0x48 */
  uint8_t RESERVED_2[16];
  __I  uint32_t SCAPABILITIES2;                    /**< Slave Capabilities 2, offset: 0x5C */
  __I  uint32_t SCAPABILITIES;                     /**< Slave Capabilities, offset: 0x60 */
  __IO uint32_t SDYNADDR;                          /**< Slave Dynamic Address, offset: 0x64 */
  __IO uint32_t SMAXLIMITS;                        /**< Slave Maximum Limits, offset: 0x68 */
  __IO uint32_t SIDPARTNO;                         /**< Slave ID Part Number, offset: 0x6C */
  __IO uint32_t SIDEXT;                            /**< Slave ID Extension, offset: 0x70 */
  __IO uint32_t SVENDORID;                         /**< Slave Vendor ID, offset: 0x74 */
  __IO uint32_t STCCLOCK;                          /**< Slave Time Control Clock, offset: 0x78 */
  __I  uint32_t SMSGMAPADDR;                       /**< Slave Message Map Address, offset: 0x7C */
  uint8_t RESERVED_3[4];
  __IO uint32_t MCTRL;                             /**< Master Main Control, offset: 0x84 */
  __IO uint32_t MSTATUS;                           /**< Master Status, offset: 0x88 */
  __IO uint32_t MIBIRULES;                         /**< Master In-band Interrupt Registry and Rules, offset: 0x8C */
  __IO uint32_t MINTSET;                           /**< Master Interrupt Set, offset: 0x90 */
  __IO uint32_t MINTCLR;                           /**< Master Interrupt Clear, offset: 0x94 */
  __I  uint32_t MINTMASKED;                        /**< Master Interrupt Mask, offset: 0x98 */
  __IO uint32_t MERRWARN;                          /**< Master Errors and Warnings, offset: 0x9C */
  __IO uint32_t MDMACTRL;                          /**< Master DMA Control, offset: 0xA0 */
  uint8_t RESERVED_4[8];
  __IO uint32_t MDATACTRL;                         /**< Master Data Control, offset: 0xAC */
  __O  uint32_t MWDATAB;                           /**< Master Write Data Byte, offset: 0xB0 */
  __O  uint32_t MWDATABE;                          /**< Master Write Data Byte End, offset: 0xB4 */
  __O  uint32_t MWDATAH;                           /**< Master Write Data Half-word, offset: 0xB8 */
  __O  uint32_t MWDATAHE;                          /**< Master Write Data Byte End, offset: 0xBC */
  __I  uint32_t MRDATAB;                           /**< Master Read Data Byte, offset: 0xC0 */
  uint8_t RESERVED_5[4];
  __I  uint32_t MRDATAH;                           /**< Master Read Data Half-word, offset: 0xC8 */
  __O  uint32_t MWDATAB1;                          /**< Byte-only Write Byte Data (to bus), offset: 0xCC */
  union {                                          /* offset: 0xD0 */
    __O  uint32_t MWMSG_SDR_CONTROL;                 /**< Master Write Message in SDR mode, offset: 0xD0 */
    __O  uint32_t MWMSG_SDR_DATA;                    /**< Master Write Message Data in SDR mode, offset: 0xD0 */
  } MWMSG_SDR;
  __I  uint32_t MRMSG_SDR;                         /**< Master Read Message in SDR mode, offset: 0xD4 */
  union {                                          /* offset: 0xD8 */
    __O  uint32_t MWMSG_DDR_CONTROL;                 /**< Master Write Message in DDR mode, offset: 0xD8 */
    __O  uint32_t MWMSG_DDR_DATA;                    /**< Master Write Message Data in DDR mode, offset: 0xD8 */
  } MWMSG_DDR;
  __I  uint32_t MRMSG_DDR;                         /**< Master Read Message in DDR mode, offset: 0xDC */
  uint8_t RESERVED_6[4];
  __IO uint32_t MDYNADDR;                          /**< Master Dynamic Address, offset: 0xE4 */
  uint8_t RESERVED_7[36];
  __IO uint32_t SCCCMASK;                          /**< CCC Mask for Unhandled CCCs, offset: 0x10C */
  __IO uint32_t SERRWARNMASK;                      /**< Mask for SERRWARN reg bits to form status bit, offset: 0x110 */
  uint8_t RESERVED_8[8];
  __I  uint32_t SMAPCTRL0;                         /**< Map Feature Control 0, offset: 0x11C */
  __IO uint32_t SMAPCTRL1;                         /**< Map Feature Control 1, offset: 0x120 */
  uint8_t RESERVED_9[28];
  __IO uint32_t IBIEXT1;                           /**< Extended IBI Data 1, offset: 0x140 */
  __IO uint32_t IBIEXT2;                           /**< Extended IBI Data 2, offset: 0x144 */
} I3C_Type, *I3C_MemMapPtr;

/** Number of instances of the I3C module. */
#define I3C_INSTANCE_COUNT                       (1u)

/* I3C - Peripheral instance base addresses */
/** Peripheral I3C base address */
#define IP_I3C_BASE                              (0x400C0000u)
/** Peripheral I3C base pointer */
#define IP_I3C                                   ((I3C_Type *)IP_I3C_BASE)
/** Array initializer of I3C peripheral base addresses */
#define IP_I3C_BASE_ADDRS                        { IP_I3C_BASE }
/** Array initializer of I3C peripheral base pointers */
#define IP_I3C_BASE_PTRS                         { IP_I3C }

/* ----------------------------------------------------------------------------
   -- I3C Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup I3C_Register_Masks I3C Register Masks
 * @{
 */

